tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Emacs dependency management
brew "cask"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# CLI tool that moves files or folder to the trash
brew "trash"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source code editor
cask "visual-studio-code"
mas "Bitwarden", id: 1352778147
